[{"job_idx": "95855044-80c2-45c3-a4c1-836911f57fe0", "job_title": "Monitoring, Evaluation, Research, and Learning (MERL) Administrator", "job_number": "22904", "functional_Area": "Business Development", "department": "Mechanical Engineering", "school_Area": "Engineering", "employment_Type": "Full-time Temporary (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "MONITORING, EVALUATION, RESEARCH, AND LEARNING (MERL) ADMINISTRATOR, Mechanical Engineering (MechE)- MIT ASPIRE (Achieving Sustainable Partnerships for Research, Innovation and Entrepreneurship) Project, to work closely with ASPIRE MEL staff in the United States and Guatemala and other team members in the development, submission, and annual updating of the project’s monitoring, evaluation, research, and learning (MERL) plan.  Will establish and maintain the project’s internal performance monitoring systems and implement a subset of the project’s MERL activities related to completion of the USAID-approved MERL plan.\n\nA full description is available at https://meche.mit.edu/sites/default/files/ASPIRE_MERL.pdf.\n\nASPIRE is developing a regionally relevant, replicable model for how Latin American universities can address local development priorities through their research, teaching, innovation, and entrepreneurial activities. This five-year, $15 million project is funded by the United States Agency for International Development (USAID) and builds on existing collaboration between MIT and its Guatemalan partners, the Universidad del Valle de Guatemala (UVG), and the Guatemalan Exporters Association (AGEXPORT).  ", "job_req": "bachelor’s degree in quantitative or qualitative methods, international affairs, economics, public administration, public policy, program evaluation, or a technical field related to the project; at least three years’ experience managing and conducting the monitoring, evaluation, and data analysis efforts for projects and at least two leading the knowledge management or continuous learning and adapting (CLA) component of projects; data management and analysis skills and ability to collect and report on performance metrics; ability to create knowledge and learning products (e.g., briefs, executive summaries, user-friendly reports, etc.) from MEL data and to communicate data in user-friendly ways, including the production of compelling visualizations; and excellent oral and written English communication skills.", "job_pre": "master’s degree with a focus on project/program evaluation or related technical field.", "date": "reposted 12/1/23"}, {"job_idx": "024f3e77-55ad-4bdc-8118-423e8980f233", "job_title": "Marketing Graphic Designer", "job_number": "23672", "functional_Area": "Credit Union", "department": "Credit Union", "school_Area": "Credit Union", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "MARKETING GRAPHIC DESIGNER, MIT Federal Credit Union (MITFCU), to create and maintain MITFCU’s visual identity and participate in a collaborative process to develop an array of print and online marketing, advertising, and brand materials.  Responsibilities include providing leadership and instruction to an internal audience/vendors/outside partners; creating a range of print and digital marketing materials; developing creative files according to print and digital specifications; communicating visual identity standards, best practices, and rationale for design choices; providing ongoing project and relationship management; supporting company sales and marketing efforts; obtaining permission(s) for copyright materials; collaborating on integrating messaging; designing digital and print solutions for integrated marketing efforts; articulating conceptual approaches of design and proposing messaging themes; participating in brainstorming, planning, and implementing overarching communications strategies; staying up-to-date on best practices for digital display on web and mobile platforms; and other duties as assigned.  ", "job_req": "bachelor’s degree in graphic design; three years’ graphic and web design experience and relevant experience in a graphic designer role (preferably in an agency or print setting); online design portfolio with a variety of project types and styles represented; strong technology skills using various industry-leading software, including expert-level proficiency with Adobe Creative Cloud; track record of satisfying clients, working within their budgets and deadlines, understanding goals, and anticipating needs; and effective project management, communication, and collaboration skills.  Must be well-versed in many facets of graphic design, including print production, digital printing, variable data, publication layout, web/email design, etc.", "job_pre": "experience with HTML 5, CSS, Bootstrap, and Google Schemas; familiarity with JavaScript and jQuery; and experience with video editing (Premiere Pro), motion graphics, marketing automation, and cross-channel marketing.", "date": "1/30/24"}, {"job_idx": "d458e609-c64b-402b-84fd-4ed8a3a8fd6b", "job_title": "Postdoctoral Associate, Global Health Engineering", "job_number": "23671", "functional_Area": "Research - Engineering", "department": "Mechanical Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "POSTDOCTORAL ASSOCIATE, GLOBAL HEALTH ENGINEERING, Mechanical Engineering (MechE), to work at the intersection of engineering, global health, and technology to innovate, design, develop, and implement solutions addressing critical global health challenges. Will collaborate with a multidisciplinary team that aims to address pressing needs and improve health outcomes and accessibility in underserved communities around the world.  Responsibilities include conducting ethnographic and field research to identify new global health innovation opportunities driven by user needs, economics, cultural practices, policy, and technology gaps; conducting research to develop new technologies, tools, and systems aimed at solving major global health problems, including infectious diseases and limited access to healthcare; and engaging with global partners to foster collaborations, secure funding, and enhance the impact of research activities.  ", "job_req": "Ph.D. in mechanical engineering or biomedical engineering or an MD/Ph.D. in a related field, with a focus on global health applications; proven experience conducting high-quality research in global health engineering or a related area; excellent analytical, statistical, problem-solving; and written and verbal communication skills; ability to convey complex technical concepts to non-technical audiences; ability to work effectively both independently and as part of a multidisciplinary and multicultural team; and proficiency with relevant research tools and technologies such as CAD software and data management platforms.", "job_pre": "experience working in low-resource settings and with diverse populations; experience with medical device design, regulatory pathways, and translational hurdles; knowledge of health systems, policies, and ethics in a global context; and familiarity with needs finding, funding, and implementation processes in the global health sector.", "date": "1/30/24"}, {"job_idx": "ed7a6988-f574-478a-bcc1-6ba742266a18", "job_title": "Administrative Assistant 2", "job_number": "23670", "functional_Area": "Office Support", "department": "Aeronautics and Astronautics", "school_Area": "Engineering", "employment_Type": "Full-Time", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "ADMINISTRATIVE ASSISTANT 2, Aeronautics and Astronautics (Aero/Astro), to provide complex administrative support, including for AeroAstro headquarters functions and faculty/principal investigators.  Responsibilities include scheduling appointments and meetings; coordinating events, including reserving space, ordering refreshments, preparing materials, and advertising; managing complex domestic and international travel, including reimbursements; website maintenance; responding to inquiries regarding policies and procedures; monitoring and ordering supplies and equipment, including selecting vendors; processing financial forms for purchasing and reimbursements; supporting faculty teaching, including photocopying, scanning homework solutions, ordering materials (books), etc.; creating and monitoring filing systems and maintaining records; training others regarding departmental and MIT policies/procedures; assisting with the upkeep of the space; assisting faculty with the preparation of grant proposals; updating faculty members’ CVs and publication lists; assisting with layout and graphics for research manuscripts; and performing other administrative, financial, and clerical duties as necessary.  ", "job_req": "high school diploma or its equivalent; three years’ administrative, office, or related experience; high-level computer proficiency, including experience with MS Office (Word, Excel, PowerPoint) and ability and willingness to learn new software; initiative; ability to prioritize, work independently, and anticipate the needs of supervisors; discretion and judgment with confidential information; strong organizational, time-management, interpersonal, and verbal and written communication skills; attention to detail and accuracy; discretion and judgment with confidential information; and ability to work effectively within a culture inclusive of individuals with diverse backgrounds, style, abilities, and motivations.", "job_pre": "college degree; experience in higher education; and proficiency with web-based management tools, including shared calendars (i.e., Google Calendar), mail and to-do lists, maintenance of group home pages and publication pages, shared file folder, and note pages (i.e., SVN, wiki).", "date": "1/30/24"}, {"job_idx": "03af820c-30d0-428b-8f92-e0e19162167a", "job_title": "Administrative Assistant 2, Department Head's Office", "job_number": "23657", "functional_Area": "Administration", "department": "Department of Biological Engineering", "school_Area": "Engineering", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "ADMINISTRATIVE ASSISTANT 2, Biological Engineering (BE), to perform a range of complex clerical, administrative, and financial duties in direct support of the day-to-day operations of the department head’s office. Will work in close collaboration with the senior administrative assistant to the department head and serve as a liaison between students, staff, DLCs (departments, labs, and centers) and external contacts; serve as the initial point of contact for visitors; coordinate meetings, events, and seminars; work on projects with the senior administrative assistant and other administrative support staff; type and proofread correspondence; handle confidential payroll and financial information; collaborate with BE human resources’ staff on submitting necessary information for personnel transactions; work closely with BE’s finance team in reviewing, reconciling, and monitoring multiple monthly account statements; distribute mail; assist with or coordinate domestic and international travel; and oversee office and laboratory space usage.  ", "job_req": "high school diploma or its equivalent; at least three years of administrative, office, or related support experience; meticulous attention to detail; excellent administrative, organizational, customer service, interpersonal, and verbal and written communication skills; ability to exercise good judgment, take the initiative, prioritize and manage multiple diverse tasks simultaneously, own and follow through on tasks, problem solve, and work both independently and as part of a team; discretion with confidential information; and proficiency with Microsoft Office, Excel, Word, PowerPoint, DocuSign, Outlook, Dropbox, Slack, and Adobe Acrobat.", "job_pre": "bachelor’s degree and experience in higher education in an administrative function.", "date": "1/30/24"}, {"job_idx": "21c1ffb5-03a8-4b80-8a8d-cff3e8a5b8a2", "job_title": "Director of Human Resources, Office of the Vice Chancellor", "job_number": "23669", "functional_Area": "Human Resources", "department": "Office of the Vice Chancellor", "school_Area": "Chancellor's", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "DIRECTOR OF HUMAN RESOURCES, Office of the Vice Chancellor (OVC), to set strategic direction and oversee a wide-range of human resource (HR) activity on behalf of the OVC.  This includes recruitment and retention programs, FlexWork, onboarding, wage and salary administration, job classification, performance development and management, organizational development, workforce and succession planning, diversity initiatives, training and development, rewards and recognition, progressive discipline, and employee relations.  Will initiate and implement ongoing assessment of HR programs and procedures, develop HR policy, coach, and mentor and develop managerial skills of OVC directors and managers; ensure integrity of HR operations and compliance across OVC; provide support and analysis for both short- and long-term human resource planning activities for the offices that report to the vice chancellor; identify and define human resource issues throughout the offices reporting to the vice chancellor, provide analysis of issues, and develop tools to support recommendations; and serve as senior counsel to the vice chancellor on all human resource planning and policy and act as integral part of OVC’s administrative and leadership teams.  ", "job_req": "bachelor’s degree; at least ten years of progressive experience as an HR generalist or its equivalent; ability to provide collaborative leadership, generate creative solutions to complex problems, adapt to and work effectively with various individuals or groups in a variety of situations, understand formal and informal organizational structures and relationships, and link long-range visions and concepts to daily work; and the ability to communicate intentions, ideas, and feelings openly and directly and encourage others to do so as well.  Job #23669-12\n\nHiring range:  $135,550 - 185,000\n\n1/29/24", "job_pre": "", "date": "1/29/24"}, {"job_idx": "b73c41fc-d324-4da7-a196-c6f143af49d6", "job_title": "Sales Development Representative", "job_number": "23668", "functional_Area": "Sales", "department": "Open Learning, Horizon", "school_Area": "Office of Provost", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "SALES DEVELOPMENT REPRESENTATIVE, Open Learning, to join MIT Horizon.  Will use existing prospect lists to send cold email campaigns to learning and development functions within large organizations; coordinate sales calls for MIT Horizon account executives; qualify prospects to inform on the basics of Horizon’s platform, content, and experiences and assess general fit; execute day-to-day operational plans; capture all activities in Salesforce with detailed notes and fit assessments; create customized presentation materials for sales opportunities; learn about all MIT Horizon offerings; join company and team meetings, including some on-site in Cambridge; and perform other duties as assigned. \n\nOpen Learning posts full job descriptions here. ", "job_req": "bachelor’s degree and at least two years of experience in sales, marketing, or related field.  Job #23668-6\n\nSalary range: $60,000 - 70,000.  The final salary will be determined by MIT’s compensation team based on the skills and experience of the selected candidate.\n\nApplication material should include a cover letter describing your most recent or most relevant professional experience.\n\nEmployment is contingent upon the completion of a satisfactory background check.\n\n1/29/24", "job_pre": "", "date": "1/29/24"}, {"job_idx": "1f111b42-f18f-415a-afa1-4de9222f0a43", "job_title": "Financial Assistant II, Parking and Transportation", "job_number": "23666", "functional_Area": "Finance/Accounting", "department": "Parking and Transportation Office", "school_Area": "Department of Facilities", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "FINANCIAL ASSISTANT II, Facilities-Operations/Campus Services-Parking and Transportation, to be responsible for the coordination and financial support of all financial activities and cost accounting, contracts, purchase orders, and customer service.  Will review, process, and/or tracking financial transactions and work under the direction of the Parking and Transportation manager.  ", "job_req": "high school diploma or its equivalent; at least three years of experience in accounting or related field; in-depth knowledge of accounting principles; solid knowledge of financial principles and practices; proficiency with MS Office and financial/accounting systems; knowledge of SAP; excellent analytical, organizational, customer service, problem-solving, interpersonal, and verbal and written communication skills; initiative; discretion and judgment with confidential information; and a flexible approach to the workload.  Must be able to implement and/or improve established financial processes in support of operational area; interact effectively with a diverse group of people, including staff from across the Institute; and meet deadlines despite frequent interruptions and handle a variety of tasks simultaneously.", "job_pre": "knowledge of MIT financial systems and policies and a bachelor’s degree in finance or accounting.", "date": "1/29/24"}, {"job_idx": "b6f7bf49-a7bd-4fd1-a5a6-ab78c6f7aaa8", "job_title": "Technical Associate I", "job_number": "23667", "functional_Area": "Research - Scientific", "department": "Comp Sci & Artificial Intelligence Lab", "school_Area": "Schwarzman College of Computing", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "TECHNICAL ASSOCIATE I, Computer Science and Artificial Intelligence Laboratory (CSAIL)-FutureTech, to join is an interdisciplinary group of computer scientists, engineers, and economists who study the foundations of progress in computing and artificial intelligence--the trends, implications, opportunities and risks.  Will work to understand the economic and technical foundations of progress in computing generally and AI in particular.  Responsibilities will include analyzing trends in deep learning or other aspects of computing; gathering primary or secondary data; preparing research visualizations; writing, presentations, and analysis; collaborating with others in the lab, contributing both to their research and the broader work of the lab; and performing other duties as requested.  ", "job_req": "bachelor's degree in economics, computer science, data science or other relevant field; two years of relevant research experience (which may include experience gained as an undergraduate); interest in the topics studied by the group; strong verbal and written English communication skills; and ability to work on teams and contribute to group projects.", "job_pre": "master’s degree in economics, computer science, data science, or other relevant field.", "date": "1/29/21"}, {"job_idx": "f63324ab-44d6-4b5c-a072-3f69e04b4fe2", "job_title": "Curriculum Lead: Production Additive Manufacturing", "job_number": "23662", "functional_Area": "Educational Technology", "department": "Mechanical Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "CURRICULUM LEAD: PRODUCTION ADDITIVE MANUFACTURING, Mechanical Engineering-Center for Advanced Production Technologies (APT), to assist with instructing MIT-led workforce development courses/workshops organized by APT.  Will lead the creation of instructional content for courses in additive manufacturing (AM) delivered online and in-person to a professional audience.  ", "job_req": "bachelor’s in mechanical engineering, manufacturing, materials science, or related field; five years’ hands-on industry experience using AM technologies or in AM-related engineering activities; proficiency with the fundamentals of industrial AM primary and secondary processes, including L-PBF of metals and polymers, multi-jet fusion/high-speed sintering, directed energy deposition, hybrid manufacturing (AM + machining), fused filament fabrication/fused deposition modeling, and metrology; experience designing and deploying parts for at least one of the above processes in real manufacturing environments; proficiency with/willingness to learn Autodesk’s Fusion360 CAD and Generative Design extension; proficiency with Materialise MAGICS or comparable software; experience with design for Manufacturing and Assembly (DfMA) and Geometric Design and Tolerancing (GD&T), application engineering, and mechanical characterization of 3D printed parts and materials; strong project management and technical communication skills; attention to detail; interest in developing instructional materials and working on a team of AM technical experts; and discretion with confidential project work.", "job_pre": "completion of MIT’s Additive Manufacturing for Innovative Design and Production program or its equivalent; advanced degree; experience in a teaching assistant/similar role; experience buying/selling printed parts, preferably in key AM industries (e.g., aerospace/defense, medical devices, oil and gas); strong industry relationships; familiarity with quality management, qualification standards, and typical methods for managing regulatory compliance and part quality with relevant bodies (e.g., FDA, FAA); and technical manufacturing skills (e.g., Six Sigma, MES and digital twin, statistical process control, EHS/facilities experience, etc.).", "date": "1/29/24"}, {"job_idx": "53e4ec66-11ec-441b-b9a0-277be43f1250", "job_title": "Predoctoral Research Fellow", "job_number": "23649", "functional_Area": "Research - Scientific", "department": "Economics", "school_Area": "Humanities, Arts, & Social Sciences", "employment_Type": "Full-Time Temporary", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "PREDOCTORAL RESEARCH FELLOW, Economics (multiple openings), to support work at all stages of the research process on projects in applied economics fields such as labor, development, and environmental and political economy.  Will be fully integrated into the research and predoc community at MIT and have the opportunity to gain exposure to and training in a broad set of economic research topics and methods.  Fellows will work on research projects with a group of faculty--Nina Roussille, Simon Jäger, and Jacob Moscona—and engage directly in the research process and implement complete project pipelines covering data cleaning, processing, and analysis as well as research and grant writing. Fellows can expect to meet regularly with professors to discuss their work, exchange ideas, and receive feedback.  Attending seminars will also be encouraged. The position is ideally suited to those planning to attend graduate school in economics, computer science, data science, or a related field. ", "job_req": "bachelor’s degree in economics, computer science, mathematics, statistics, or a related field; at least two years of specialized experience with qualitative data analysis, research methods, social sciences (which may include experience gained as an undergraduate); strong analytical and Stata coding skills; meticulous attention to detail; self-motivation and ability to work independently; and strong organizational and communication skills.  Job #23649\n\nPlease apply with a cover letter and resume in a single PDF titled “RA_Application_[First name]_[Last name].pdf.” Questions should be directed to nroussil@mit.edu.  Application reviews and interviews will be conducted in February.\n\nThe preferred start date is June 1, 2024. An employment term of one to two years is expected.\n\nThe fellowships will be full-time positions located in Cambridge, Massachusetts.\n\n1/29/24", "job_pre": "", "date": "1/29/24"}, {"job_idx": "b8ab1880-9bc0-424f-ab29-c15dafbe19cc", "job_title": "FutureTech xAI Program Manager", "job_number": "23656", "functional_Area": "Grants Administration/Management", "department": "Comp Sci & Artificial Intelligence Lab", "school_Area": "Schwarzman College of Computing", "employment_Type": "Part-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "FUTURETECH XAI PROGRAM MANAGER, Computer Science and Artificial Intelligence Lab (CSAIL) (part-time, 80%), to join a project that wishes to create a sub-organization focused on issues of AI scaling.  Will lead the development of the xAI program end-to-end, starting with identifying strategic priorities, scoping out the resources needed, recruiting staff, managing execution, and driving results.  Will also lead a broader effort beyond CSAIL and MIT. This will involve identifying key strategic questions faced by those scaling AI models, evaluating which questions are crucial for policy, understanding the AI expertise needed to answer these, and marshalling the financial and human resources needed to complete these tasks. These external efforts are intended to take the form of a consortium, including labs from across MIT and external industry partners. Key to the role will be understanding the extraordinarily complicated world of AI scaling, the guiding principle behind the success of OpenAI, DeepMind, etc., understanding that AI scaling priorities involve the enormously complex task of absorbing key developments in AI.  Will manage these complexities through a combination of strong, established AI knowledge and by leveraging personal/professional networks of AI experts.  \n\nFull job description available here.  ", "job_req": "bachelor’s degree; seven years’ operational and technical leadership experience in AI-related organizations; strong technical knowledge of AI scaling laws; experience managing large teams; demonstrated history of strategic insights on AI in the face of complexity and uncertain environments; comprehensive knowledge of key AI trends and the strengths and weakness of how they were operationalized; and a network of contacts in AI that can provide insight/guidance on difficult AI challenges.", "job_pre": "master's degree (Ph.D. preferred) in computer science, artificial intelligence, or closely related field.", "date": "1/26/24"}, {"job_idx": "d284c907-62e8-4151-a62d-a8a51f839e13", "job_title": "Maintenance Planner", "job_number": "23664", "functional_Area": "Facilities", "department": "Dof Central Utilities Plant", "school_Area": "Department of Facilities", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "MAINTENANCE PLANNER, Facilities-Central Utilities Plant (CUP), to be responsible for--under the general direction of the maintenance manager--scheduling corrective, preventative, predictive, and equipment outage maintenance work orders utilizing the SAP notification and work order management system.  Will assist the manager and supervisor by ordering repair parts, assist with maintaining the critical spare parts inventory, provide contract and purchase order support with outside vendors for materials and services, and ensure outside vendors are compliant with MIT CUP’s safety orientation policy. Will utilize the SAP computerized maintenance management system (CMMS) and work closely with the manager and supervisor to develop and schedule PM work plans, review notifications, and schedule corrective work orders with CUP maintenance personnel and/or contractors accordingly.  ", "job_req": "bachelor’s degree in a related field; at least five years of trade, construction, engineering, or maintenance experience and an in-depth understanding of preventive and predictive maintenance practices and principles; experience using CMMS software preferably with SAP; meticulous attention to detail; and excellent interpersonal and communication skills.", "job_pre": "five years of experience in an operating power plant or a manufacturing, pharmaceutical, or hospital environment.", "date": "1/29/24"}, {"job_idx": "5ebf7b41-aa5d-4bba-b804-8e0a71cda878", "job_title": "Postdoctoral Associate", "job_number": "23663", "functional_Area": "Research - Engineering", "department": "Civil and Environmental Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "POSTDOCTORAL ASSOCIATE, Civil and Environmental Engineering, to conduct groundbreaking research in nature-based carbon sequestration solutions.  Will explore and enhance soil organic carbon stocks through sustainable agricultural practices. This includes detailed study and development of a more reliable Monitoring, Reporting, and Verification (MRV) protocol.  The research is aimed at providing substantial contributions to the understanding of carbon dynamics in agricultural systems, with a focus on improving overall soil health, reducing GHG emissions, increasing carbon capture, and accurately measuring the carbon footprint of agriculture.  Will collaborate with the MIT team and external partners, including industry leaders, to enrich case studies and enhance the project's relevance and impact in the field. The position offers the opportunity to contribute to peer-reviewed publications, present findings at scientific conferences, and mentor graduate and undergraduate students.  ", "job_req": "Ph.D. in environmental science, agronomy, ecology, or a closely related field; background in soil science, carbon dynamics, carbon markets, and sustainable agricultural practices; proven experience conducting original scientific research and publishing in scientific journals; and ability to effectively communicate complex scientific concepts and work collaboratively in a dynamic, interdisciplinary team environment that includes collaboration with staff and students from MIT and other universities and industry partners.", "job_pre": "experience with machine learning techniques, remote sensing, and soil carbon measurement methodologies; proficiency with programming languages such as Python or R; and a demonstrated interest in applying scientific research to practical solutions.", "date": "1/29/24"}, {"job_idx": "d19b98a1-1992-4639-bfe4-0f1ba370603e", "job_title": "Tax Analyst", "job_number": "23661", "functional_Area": "Finance/Accounting", "department": "Office of the Vice President for Finance", "school_Area": "VP for Finance", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "TAX ANALYST, Office of the Vice President for Finance (VPF), to support MIT’s tax compliance, reporting, analysis, and research needs.  Will assist with data collection and analysis for tax compliance and reporting; interact with a wide variety of stakeholders on MIT’s annual tax returns; research and resolve basic inquiries/issues regarding tax reporting and filings; and support the team’s efforts to educate the MIT community on a variety of tax policies/procedures. \n\nVPF posts full job descriptions here.", "job_req": "bachelor's degree in accounting, finance, economics, or a related financial/business field; at least one year of experience with federal, state, local, and/or international tax, preferably with a public accounting firm, large law firm, multinational corporation, nonprofit tax department, or higher education; knowledge of U.S. tax reporting and general taxation principles; demonstrated customer service experience in an accounting, finance, economics, or related business field; strong Excel, Word, and PowerPoint skills; excellent analytical, problem-solving, organizational, customer service, and written and verbal communication skills; and discretion, tact, and good judgment with highly sensitive/confidential information.  Seek a self-starter who can work successfully on multiple challenging projects simultaneously and is able to build interpersonal relationships and work collaboratively and collegially in a consensus-driven, fast-paced, and high-volume environment with non-negotiable deadlines.", "job_pre": "experience assisting on large tax compliance projects for complex multinational organizations; knowledge of and experience with unrelated business income and reporting on the Form 990-T and related forms (8886, 5471, 926, 8885, 8621, 8858, 5713); understanding of flow-through investment entity structures and ability to read and interpret IRS Form K-1; ability to conduct tax research, including IRS code, regulations, rulings, and case law.", "date": "1/26/24"}, {"job_idx": "a64e5705-5340-4595-908e-9754cc430da6", "job_title": "Patient Coordinator, Tsai Lab", "job_number": "23660", "functional_Area": "Research - Scientific", "department": "Picower Institute for Learning & Memory", "school_Area": "Science", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "PATIENT COORDINATOR, Picower Institute for Learning and Memory-Tsai Lab, to assist with clinical research studies conducted at MIT and at MGH that are designed to evaluate whether Gamma ENtrainment Using Sensory (GENUS) stimulation can be used to help people with memory impairment or are at risk of developing impairment.  Responsibilities include overseeing protocol development and IRB submissions and maintaining IRB protocols and certifications, with input from researchers and study leaders; serving as the primary contact person for study subjects; screening subjects for inclusion in the study; scheduling, preparing, and helping conduct subject study visits; following up with subjects between study visits; coordinating and participating in activities during study visits such as neuropsych testing, MRI and EEG recording, and sample collection and processing; and ensuring timely database entry of study notes and data.  Will perform other duties as assigned, including purchasing, maintaining, and shipping study and research materials; and making occasional visits to subjects’ homes in and around Boston and Cambridge. \n\nThis position offers outstanding opportunities for gaining experience in clinical research and clinical patient interaction and for participating in ground-breaking translational research.  ", "job_req": "bachelor’s degree in a specialized or related field based on hiring lab; at least two years of related lab experience; excellent organizational, communication, and interpersonal skills; attention to detail; proactive approach to responsibilities and consistent follow-through; and ability to prioritize and effectively manage time.  Job #23660\n\n1/26/24", "job_pre": "", "date": "1/26/24"}, {"job_idx": "d824e436-2bee-4550-bc23-9d61166190fa", "job_title": "Member Experience Manager, Contact Center", "job_number": "23655", "functional_Area": "Credit Union", "department": "Credit Union", "school_Area": "Credit Union", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "MEMBER EXPERIENCE MANAGER, CONTACT CENTER, MIT Federal Credit Union (MITFCU), to oversee the day-to-day operation of the contact center, including contact center representatives and virtual teller staff.  Will be responsible for achieving established service and business objectives; educating, developing, coaching, and training employees; initiating systems and operations improvements; and providing outstanding service to MITFCU membership.  Responsibilities include hiring, onboarding, training, coaching, counseling, disciplining, and conducting performance evaluations for member experience employees; tracking emerging trends in contact center operations management; setting goals and actively engaging staff in competitions to achieve/exceed product sales objectives;  ensuring call/VTM quality and proactively seeking ways to improve internal processes and results; acting as phone and teller now system liaison, monitoring system flow and analyzing activity to identify deficiencies and make recommendations for improvement; supporting continuous improvement of department processes; participating in sales campaigns and business development initiatives; maintaining and reporting on call, sales, and teller transaction results; implementing and maintaining all call center telephony modifications and upgrades; overseeing end-of-day balancing of VTM machines and Teller Now system; ensuring staff adheres to Bank Secrecy Act (BSA) policies/procedures; managing distribution of all member outreach activities; monitoring key performance measures; preparing and maintaining ongoing sales analytical reports; and performing other duties as needed.  ", "job_req": "high school diploma or its equivalent; five years’ call center or support team management experience, preferably for a credit union/bank; proven record of successful staff management, coaching, and development; strong communication skills; and ability to interact with CEO and executive management team to resolve complex member and/or account issues.", "job_pre": "bachelor’s degree and solid working knowledge of financial service rules and regulations.", "date": "1/26/24"}, {"job_idx": "66af3956-2c13-4547-8f13-58472018354c", "job_title": "Financial Administrator", "job_number": "23654", "functional_Area": "Finance/Accounting", "department": "Biology", "school_Area": "Science", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "FINANCIAL ADMINISTRATOR, Biology, to manage and administer a complex portfolio of faculty-controlled funds from proposal to closeout and advise and educate faculty/researchers on all aspects of research administration.  Pre-award responsibilities include preparing and submitting research proposals and pre- and post-doctoral fellowship applications; developing budgets and budget justification; coordinating collection of required materials; and proposal submission.  Post-award duties include account set-up and extension; handling sponsor billing agreements and invoice payments; monitoring financial performance to ensure compliance; preparing budget forecasts and financial analyses; overseeing subawards; monitoring salary allocations; overseeing financial review and control process; resolving financial issues; and managing closeout processes and audit inquiries.  Will also interpret MIT and government policies; train and mentor financial/administrative assistants; stay abreast of changing policies/procedures, technologies, and deadlines; liaising with other MIT offices and outside funding agencies; and handle additional responsibilities as assigned. \n\nFull description available here.  ", "job_req": "bachelor's degree; five years' financial management experience, preferably in an academic environment; experience with pre- and post-award research administration and sponsored programs; knowledge of standard federal regulations and major agency guidelines, preferably the NIH; high-level proficiency with Excel, familiarity with other MS Office products, and ability to learn changing grant/contract management-related technologies; initiative; excellent organizational, interpersonal, and communication skills; attention to detail; ability to manage a variety of tasks concurrently, research and resolve discrepancies, exercise sound judgment, anticipate needs, work independently and as part of a team, and remain flexible as situations demand; and discretion and diplomacy with confidential information/issues.", "job_pre": "experience with MIT financial systems, particularly BrioQuery, Cognos, Concur, FRC, GAP, Kuali-Coeus, and SAP/SAPgui; and knowledge of Tableau and QuickBase.", "date": "1/26/24"}, {"job_idx": "d7830ddf-615c-4830-b433-1e12324b6eaf", "job_title": "Executive Director, Human Resources", "job_number": "23653", "functional_Area": "Human Resources", "department": "MIT Sloan Human Resources", "school_Area": "Sloan School of Management", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "EXECUTIVE DIRECTOR, HUMAN RESOURCES (HR), Sloan School of Management, to establish and implement HR efforts that effectively communicate and support the school’s mission and strategic vision. Will develop a deep working knowledge of the culture, history, and work of the school, including the various constituencies serviced by this role; and work as a key member of a senior administrative management team with accountabilities to the chief administrative officer, dean, and other members of the school’s top leadership team.  Responsibilities include developing and executing an approach that supports the HR department and all of its functions and providing strategic human resources consulting services in the areas of complex organizational design and development, change management, recruiting and onboarding, employee relations, compensation philosophy, training and organization development, faculty and research appointments, and operations. \n\nA full job description is available at https://web.mit.edu/sloan-hr/jobs/HRExecutiveDirector.pdf.  ", "job_req": "bachelor’s degree in human resources, business administration, strategic management, or related field; ten years of related experience; ability to motivate and manage teams, hold self and staff accountable for delivering on organizational objectives, and work effectively as a team player across and within a complex institution; understanding of institutional direction; a collaborative, consultative, accessible, direct, and transparent interpersonal approach to working with all institutional constituencies; and excellent leadership, management, problem-solving, and solution-finding skills.", "job_pre": "master’s degree in organization development or a related field or an MBA, experience in senior HR leadership for an organization of 500 or more employees, and higher education experience.", "date": "m2-partners, an executive search and talent firm, has been retained to conduct this search. Consideration of candidates will continue until the position is filled.  In addition to applying via the MIT website, candidates should submit, in confidence, a resume and cover letter. Communications, nominations, applications, and inquiries concerning this search should be directed to Richard Fleming, Managing Director, at rfleming@m2-partners.com and/or Janet Mullert, Co-Founder and Managing Partner, at jmullert@m2-partners.com"}, {"job_idx": "4f11c9ec-c56d-4da4-9058-d9681858e359", "job_title": "Program Scientist, Center for Gynepathology Research (CGR)", "job_number": "23652", "functional_Area": "Research - Engineering", "department": "Department of Biological Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "PROGRAM SCIENTIST, Biological Engineering-Center for Gynepathology Research (CGR), to further the mission of catalyzing the translation of forefront research in systems biology and microphysiological systems into clinical impact for patients with endometriosis, adenomyosis, and other gynecological disorders. A strong current research focus is on the intersection of gynecological disorders with infectious diseases, especially Lyme disease, and other infections associated with chronic symptoms in a subset of patients.  Responsibilities include coordinating multi-investigator projects spanning basic research in mechanisms of endometriosis and adenomyosis lesion development and growth, pilot tests of new therapeutic modalities, assessing new engineering technologies for illuminating pathophysiology of gynecological disease states, and collaborating with an immunology team investigating links with Lyme disease and other potential infectious triggers; participating in at least one bench-level project aimed at publication; assisting with laboratory operations, including overseeing technical staff, maintaining continuity of proposal transfer between lab members, preparing grant proposals, and hosting visitors for tutorials on protocols developed by the CGR investigators. \n\nThe position offers close interactions with clinicians and ample learning opportunities.  ", "job_req": "Ph.D. in bioengineering, chemical engineering, biology, chemistry, or related discipline; four years’ related postdoctoral experience; peer-reviewed publication record of independent research in CGR research areas; experience with primary human mammalian cell culture, imaging, human immunology, and immunoassays; strong analytical, organizational, record-keeping, time-management, planning, problem-solving, interpersonal, writing, and communication skills; attention to detail; initiative; ability to mentor junior lab members, work collaboratively, multitask, and perform independent research in a fast-paced multidisciplinary environment; and an interest in women’s health.", "job_pre": "experience with tissue engineering, biomaterials, pharmacokinetics, bioreactors, and/or microﬂuidics; and experience with electronic lab notebooks, e.g., Lab Archives.", "date": "1/26/24"}, {"job_idx": "eb8a3194-9a87-4621-a028-590d5a154c11", "job_title": "Director, Employee and Labor Relations", "job_number": "23651", "functional_Area": "Human Resources", "department": "Human Resources", "school_Area": "VP for Human Resources", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "DIRECTOR, EMPLOYEE AND LABOR RELATIONS, Human Resources (HR), to lead, support, and develop central Human Resources’ Employee and Labor Relations teams.  Will develop strategies for maintaining harmonious, productive, and legally compliant employer-employee relationships and practices within MIT and for promoting and for negotiating agreements and maintaining positive relations between the Institute and its seven unions and unionized employees; oversee collective bargaining obligations; strive to prevent, address, and resolve workplace issues, informally whenever possible; assign and oversee investigations into workplace misconduct; ensure the fair and consistent interpretation and application of employment laws and policies, including federal and state employment laws and regulations and MIT policy; collaborate with HR colleagues both internal and external to central Human Resources to develop and implement programs, strategies, and practices to advance and support MIT's commitment to its workforce and to meet legal requirements; carry forward MIT’s long-standing commitment to workplace diversity, affirmative action, and equal opportunity; and support all parties in the execution of HR initiatives that impact the Institute and its employees.  ", "job_req": "bachelor’s degree; at least ten years of experience in employee relations, labor relations, and/or other relevant areas of HR; excellent oral and written communication skills; demonstrated ability to interact constructively with senior and mid-level management, employees at all levels, and union representatives; thorough knowledge of and experience with employment law and employee relations; familiarity with labor law and experience working with unions; experience managing in work teams; and experience with negotiation and conflict management.", "job_pre": "J.D. or advanced degree.", "date": "1/25/24"}, {"job_idx": "18c36ce1-a4c4-404b-9924-e01e1e74d2bd", "job_title": "Annual Giving Officer", "job_number": "23184", "functional_Area": "Development/Fundraising", "department": "Alumni Association", "school_Area": "Alumni Association", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "ANNUAL GIVING OFFICER, Alumni Association, to represent the Institute in constituent visits or at events, with the primary focus of building membership in the Annual Giving Leadership Circle (AGLC), which recognizes donors who support MIT through annual gifts of $2,500 or more.  Will engage with existing and potential donors through extensive outreach efforts that will progress to increased prospect work which will involve managing, cultivating, and soliciting a regionally-based pool of prospects with annual giving potential of $1,000 to $100,000; develop, manage, and support a small portfolio of volunteers to aid in this process when applicable; and engage annual donors in the compelling case for unrestricted support of the Institute.  ", "job_req": "bachelor’s degree; at least three years of annual giving experience, preferably in nonprofit fundraising environments; experience conducting donor solicitations; excellent interpersonal and communication (written, verbal, listening) skills; attention to detail; self-motivated and a proven record of accomplishment in a position requiring independent planning and efficient utilization f time and resources; discretion with confidential information; proficiency with computers and standard applications (including Microsoft Word, Excel, Outlook, Zoom, and PowerPoint); and experience with Ellucian Advance Web, Evertrue, or other enterprise fundraising system.  Must be able to engage and build relationships with colleagues, faculty, leadership, staff, alumni, volunteers, donors, and other external constituents; work independently and collaboratively; and multitask, prioritize assignments, and meet deadlines, without compromising quality, in a demanding, high-volume work environment.", "job_pre": "knowledge of major gift and planned giving best practices, and higher education experience.", "date": "9/11/23"}, {"job_idx": "4ca56105-15fc-4ce4-9012-4c12736b61bc", "job_title": "Event Manager and Producer", "job_number": "23635", "functional_Area": "Event Planning", "department": "Media Lab", "school_Area": "Architecture & Planning", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "EVENT MANAGER AND PRODUCER, Media Lab, to plan and execute a wide variety of concurrent events hosted by the director and the External Relations group as well as other lab-wide and high-level large-scale events with more than 500 guests.  Will produce events, paying close attention to design, purpose, scope, and audience in accordance with the lab director’s vision and objectives; manage, lead, and attend to deadlines for the organization’s many concurrent events along with special Media Lab-wide or other high-level events; design and build a cohesive and individual look and feel for each event that represents the MIT Media Lab’s unique DNA; and provide input into the development of event strategy, content, and communications. \n\nA full job description is available at https://www.media.mit.edu/about/job-opportunities/.  ", "job_req": "bachelor’s degree; at least three years of event management experience, including large-scale events of more than 500 guests; strong problem-solving, interpersonal, and written and verbal communication skills; experience developing and maintaining annual budgets; discretion with confidential information; and comfort with and an interest in working in a technology-driven environment; and ability to interact effectively with customers, both independently and as a member of a team, and work effectively in times of crisis.  Seek someone who is cognizant of organizational dynamics and can build and foster relationships within the lab and with colleagues at MIT.", "job_pre": "at least five years’ event management experience, and expertise with MIT financial processes and systems.", "date": "1/22/24"}, {"job_idx": "e1a0f30d-4976-4bb2-b3d4-7b0d41ca6b45", "job_title": "Director of Events", "job_number": "23650", "functional_Area": "Event Planning", "department": "Vice Pres for Resource Development", "school_Area": "VP for Resource Development", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "DIRECTOR OF EVENTS, Resource Development (RD), to partner with the executive director of communications, events, donor relations, and stewardship on the strategy, planning, and execution of events for the engagement, cultivation, recognition, and stewardship of current and prospective MIT donors.  Events often involve the president, Institute officers, faculty, domestic and international dignitaries, and other influential leaders.  Will lead a team of five and collaborate with fundraisers/colleagues within RD and across MIT, coordinate the work of external vendors, and conceptualize and produce curated and compelling event experiences that showcase Institute priorities and philanthropic impact and opportunities. ", "job_req": "bachelor’s degree; five years’ event management experience, preferably in a nonprofit or higher education environment; two years’ supervisory experience, preferably leading an event production team; excellent project management, problem-solving, organizational, customer service, negotiation, facilitation, presentation, writing, and oral communication skills; meticulous attention to detail; excellent judgment with confidential information; familiarity with Mac computers and proficiency with standard applications, including Microsoft Word, Excel, and PowerPoint; and support for MIT’s diversity, equity, and inclusion priorities.  Seek an event planning professional who brings a strategic approach to the events function and is able to manage important relationships and act as an ambassador for MIT; function as part of a cohesive team; develop working knowledge of donor and senior leadership preferences/needs; effectively plan event catering suitable for a variety of guests; and work under pressure in a demanding, fast-paced environment.", "job_pre": "experience with Zoom, Cvent, G-Suite (e.g., Docs, Sheets),  collaboration tools (e.g., Workfront, Slack), and Dropbox; familiarity with MIT; experience in higher education; knowledge of international cultures; and ability to speak a second language.", "date": "1/24/24"}, {"job_idx": "2db4fb4f-50db-42fc-a8b4-32d290b26772", "job_title": "Senior Administrative Assistant", "job_number": "23573", "functional_Area": "Administration", "department": "Business & Digital Transformation Office", "school_Area": "Executive Vice President", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "SENIOR ADMINISTRATIVE ASSISTANT, Business and Digital Transformation Office (BDTO), to report to the chief officer for business and digital transformation and perform a wide range of complex administrative and support duties in support of the BDTO.  Will manage the complex calendars of the chief officer and his directors; serve as the first point of contact for and respond to inquiries on behalf of the chief officer; schedule and coordinate meetings on behalf of the chief officer and the BDTO team; perform general office management, reception, and event planning duties under minimal supervision; and assist with BDTO and/or Institute-wide programs and projects.  \n\nBDTO posts job descriptions here.", "job_req": "high school diploma or its equivalent; at least five years of administrative, office, or related experience; strong organizational, problem-solving, interpersonal, and written (including spelling, punctuation, and grammar) and verbal communication skills; meticulous attention to detail; advanced-level knowledge of Microsoft Word, Excel, Outlook, and PowerPoint and ability to identify and learn new applications as necessary; discretion, tact, and good judgment with sensitive/confidential information; and a flexible approach to the workload and with regard to learning new tasks, taking on new assignments, and supporting team initiatives.  Seek someone who welcomes a variety of work challenges and is able to proactively anticipate issues/complications related to scheduling, events, and logistics; manage multiple priorities and a high volume of work while meeting deadlines and without compromising quality in a demanding, fast-paced work environment; work both independently and as part of a team; and interact effectively with a wide range of individuals within and outside of the MIT community.", "job_pre": "post-high school education, experience in an educational environment, and MIT experience.", "date": "12/22/23"}, {"job_idx": "a057a282-d735-4477-86e3-f377438cf42c", "job_title": "Manager, Content and Communications", "job_number": "23648", "functional_Area": "Communications", "department": "Open Learning, J-WEL", "school_Area": "Office of Provost", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "MANAGER, CONTENT AND COMMUNICATIONS, Open Learning-Jameel World Education Lab (J-WEL), to use expertise in the design, development, and dissemination of content to reach educators and decision-makers across the world.  Responsibilities include collaborating on setting content strategy and executing key elements; creating new content; designing content creation schedule and aligning with events/opportunities; participating in website relaunch; developing annual reports and outreach materials; brand management; overseeing the development of presentation materials and other integrated communications resources; designing and running communications campaigns; managing the communications budget; determining objectives and success metrics; developing methods for collecting feedback; overseeing and supporting events design; and performing other duties as assigned.  \n\nA full description is available at https://openlearning.mit.edu/jobs.  ", "job_req": "bachelor’s degree in related field; four years' experience overseeing communications and content creation functions; experience managing staff and engagements with external partners/agencies; proficiency with MS Office (Excel, Word, PowerPoint), Google Suite, Acrobat, Adobe Creative Suite, Canva or other graphical design tools, MailChimp or other newsletter tools, and communication and collaboration tools/platforms (e.g., Facebook, Twitter, LinkedIn, YouTube, WordPress, etc.); knowledge of web, video, and audio platforms; ability to quickly adapt to new communications technologies; excellent interpersonal skills, including ability to effectively collaborate with people at all levels and represent J-WEL to outside parties and the media; flexibility; excellent organizational, proofreading, and verbal and written communication skills; and ability to manage multiple requests simultaneously.  Job #23648-8\n\nSalary range: $88,000 - 100,000.  The final salary will be determined by MIT's compensation team and be based on the skills and experience of the selected candidate.\n\n1/24/24", "job_pre": "", "date": "1/24/24"}, {"job_idx": "00063dcb-9a29-477e-ad0f-033940389e47", "job_title": "Instructor of Introductory Biology", "job_number": "23647", "functional_Area": "Academic (non-faculty)", "department": "Biology", "school_Area": "Science", "employment_Type": "Full-Time Temporary", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "INSTRUCTOR OF INTRODUCTORY BIOLOGY, Biology, to provide administrative and instructional support for two Introductory biology courses per semester. Introductory Biology (7.01) is a core requirement for all MIT undergraduate students with a focus on biochemistry, genetics, and molecular biology.   Responsibilities include working as part of a team to develop improved materials and structure for 7.01 and managing critical tasks during the term, e.g., preparing student assessments, providing teaching materials, and running the online aspects of the course; providing ongoing technical and instructional support for the instructional teams; collaborating on aligning the 7.01 curriculum with the shared core competencies for introductory biology courses; monitoring and addressing student progress, informing students and faculty about any concerns; acting as the point-of-contact and administrative lead on course logistics and planning; creating and maintaining communication systems; supervising graduate/undergraduate students teaching Introductory Biology; revising and managing the implementation of the 7.01 advanced standing exam; becoming familiar with the duties performed by the instructor for pedagogy training and serving as substitute if needed; incorporating evidence-based pedagogical techniques into 7.01; and attending MIT seminars, professional meetings, and training to improve instruction.  ", "job_req": "Ph.D. in biology or closely related field; interest in and experience teaching (may include experience as a teaching assistant and outreach); knowledge of evidence-based teaching and learning practices; excellent interpersonal skills; ability to build productive working relationships with a wide range of people; experience with learning management systems and tools that support teaching and learning; and interest in developing new innovative curricula and teaching approaches.", "job_pre": "computational experience, especially in the application of solving biology questions.", "date": "1/24/24"}, {"job_idx": "c8d1bb6e-c143-4ba2-85c2-a8185d3970ab", "job_title": "Postdoctoral Fellow, Haptic Interface Design", "job_number": "23644", "functional_Area": "Research - Engineering", "department": "Mechanical Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "POSTDOCTORAL FELLOW, HAPTIC INTERFACE DESIGN, Mechanical Engineering, to conduct research on the design of haptic interfaces and mechatronic systems as a member of the 77 Lab, a collaborative research environment in robotics, rehabilitation robotics, agricultural robotics, and digital transformation. The broad goal of this one-year project is to design a novel haptic interface for heavy equipment. Its specific aim is to design the mechatronic package, implement the controller, integrate it with the lab’s simulator, and determine the impact of this technology on operators performing the job.  Will design/implement the mechatronic interface, coordinate manufacturing of the tool, characterize the tool, design and implement the controller, integrate with the lab’s simulator, and investigate the use of this interface.  ", "job_req": "Ph.D. in mechanical engineering, mechatronics, or a related field.", "job_pre": "research experience with design, manufacturing, and ergonomics; hands-on experience with robotic hardware and tool usage in a field environment; experience with ROS (Robot Operating System); proficiency with design software using Solidworks, 3-D printing software, etc; proficiency with software engineering using C/C++, OpenCV, MATLAB, Unity3D, etc; knowledge of machining; experience with Linux and development on Linux systems; proven system integration and software architecture skills; and a strong track record of academic publications.", "date": "1/24/24"}, {"job_idx": "c9aa684e-583a-44a6-927b-c209196cbfa8", "job_title": "Member Experience Specialist II", "job_number": "23642", "functional_Area": "Credit Union", "department": "Credit Union", "school_Area": "Credit Union", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "", "job_req": "high school diploma or its equivalent; at least three years’ related experience, preferably in financial services; ability to complete and pass all product and services certifications; strong interpersonal, member/customer service, analytical, and verbal and written communication skills; attention to detail; accurate typing; mathematical skills; working knowledge of PCs and familiarity with Microsoft software; comfort providing customer service in a virtual environment; ability to build relationships across an organization; and ability and willingness to keep current on changes in technology and electronic and alternative delivery methods.", "job_pre": "one year of experience with cash handling, credit card transactions, and balancing; and familiarity with office equipment.", "date": "1/24/24"}, {"job_idx": "858a14ea-cb2d-49ff-9e4e-76613036e8ab", "job_title": "Postdoctoral Associate, AgeLab", "job_number": "23643", "functional_Area": "Research - Engineering", "department": "Center for Transportation & Logistics", "school_Area": "Engineering", "employment_Type": "Full-Time Temporary", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "POSTDOCTORAL ASSOCIATE, AGELAB, Center for Transportation & Logistics (CTL), to support a broad range of naturalistic driving research efforts.  Will collaborate with senior researchers to explore novel data sets and design, and develop new data extraction approaches from telemetry data and video.  Responsibilities include designing, building, and performing analytical experiments on naturalistic driving data; reporting on results with an emphasis on developing the foundations of research needed to influence the design and development of vehicle safety systems; leading and contributing to the development of joint publications, participating in conferences, and sharing results with laboratory partners and industry sponsors; and collaborating with the research team on defining research priorities.\n\nThis position offers an opportunity to work with cutting-edge naturalistic driving data; and enhance societal understanding of driver safety in areas encompassing driver attention (distraction), Advanced Driver Assistance Systems (ADAS), and other higher-level forms of automated driving.  ", "job_req": "Ph.D. in industrial engineering, psychology, physiology, human factors, computer science, public health, or a demonstrably relevant field; record of individual initiative and originality in research; strong analytical skills; and familiarity with statistical software tools such as R or Python.", "job_pre": "training, skills, and research interests that complement the research interests of the MIT research team.  Candidates with backgrounds and experience in human factors, experimental psychology, data sciences, machine learning, deep learning, or similar areas of expertise are encouraged to apply.", "date": "1/24/24"}, {"job_idx": "ffc6d42d-55ca-4ce5-8eaa-cffa0165b883", "job_title": "Assistant Director of Events", "job_number": "23646", "functional_Area": "Event Planning", "department": "Career Advising & Professional Devt", "school_Area": "Chancellor's", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "ASSISTANT DIRECTOR OF EVENTS, Career Advising and Professional Development (CAPD), to lead a team of two event assistants and oversee and execute career fairs, large-scale and signature employer engagement events, and office events.  Will collaborate with CAPD teams on the operations’ plans and logistics in delivering events and programs on career advising, graduate professional development, distinguished fellowships, prehealth advising, and employer relations; provide strategic direction on all aspects of the event planning, including task delegation to committee members, event scope and details, logistics, marketing and outreach, communications, financial oversight, and vendor management; and advise external CAPD offices and groups on best practices involved in organizing career fairs and career expos. \n\nA full description is available here.  ", "job_req": "bachelor's degree; three years of experience in event management, higher education, hospitality, or other relevant industry experience; experience using project management tools such as Asana, Monday, Airtable, etc., to run team projects; knowledge of budget preparation and administration and financial recordkeeping and reporting; and experience supervising full-time employees.  Job #23646-8\n\nSalary range: $80,000 - 94,000, based on experience.\n\nA hybrid schedule, with both remote and on-campus work, is available.  Occasional evening and weekend work.\n\nApplications submitted by February 14, 2024, will be fully considered.\n\nEmployment is contingent upon the completion of a satisfactory background check.\n\n1/23/24", "job_pre": "", "date": "1/23/24"}, {"job_idx": "81db532a-5a64-4e4d-becc-3a01955504f0", "job_title": "Senior Research Support Associate", "job_number": "23645", "functional_Area": "Administration", "department": "Economics", "school_Area": "Humanities, Arts, & Social Sciences", "employment_Type": "Full-Time Temporary", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "SENIOR RESEARCH SUPPORT ASSOCIATE, Economics (2 openings), to work with a group of faculty on both administrative- and research-related projects that may include statistical analysis of data. Will assist with research through locating information, proofreading works, and preparing tables for papers in the process of publication; and assist in the fielding of experiments and surveys. General administrative responsibilities include managing calendars and appointments, preparing and processing travel arrangements, preparing expenses for processing, assisting with faculty budgets, managing faculty websites with publications and course materials, preparing and transmitting correspondence for recommendations and other related mailings, assisting with class and seminar preparation, and other miscellaneous duties.  ", "job_req": "high school diploma or its equivalent; knowledge of social science research and data collection methods (qualitative and quantitative); strong organizational, interpersonal, and communication skills; and the ability to meet deadlines and work both independently and as part of a team.", "job_pre": "strong statistical analysis skills (Stata or R), data management experience (spreadsheets and databases), and a bachelor’s degree in economics or a related social science discipline.", "date": "1/23/24"}, {"job_idx": "ece7dba6-2b9d-4bed-b016-f324abaa1e0e", "job_title": "Patient Services Representative, Contact Center", "job_number": "23641", "functional_Area": "Health Care", "department": "Medical", "school_Area": "Executive Vice President", "employment_Type": "Full-Time", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "PATIENT SERVICES REPRESENTATIVE, CONTACT CENTER, MIT Health, to be responsible for managing incoming telephone calls and inbox messages from patients.  Will often act as the first point of contact that patients and other personnel will have with MIT Health.  Responsibilities include providing excellent customer service, providing detailed communications, and de-escalating and providing resolutions to problems/issues; processing the registration of new patients, ensuring accurate insurance eligibility information; scheduling appointments; providing advice about copays and the pre-visit process; answering general and troubleshooting complex patient inquiries; and screening callers for triage and coordinating with internal and external service areas.  This position involves frequent communication with patients, providers, and other service areas. \n\nA detailed position description is available at https://medical.mit.edu/jobs.  ", "job_req": "high school diploma or its equivalent; at least two years of experience in a customer service or administrative role; ability to perform multiple tasks simultaneously; effective telephone skills and ability to communicate diplomatically with patients, clinicians, and other professional staff.", "job_pre": "experience in a healthcare setting.", "date": "1/23/24"}, {"job_idx": "991e354b-b97b-44e2-a020-af4e5ff877d2", "job_title": "Postdoctoral Associate, Multiscale Ocean Modeling", "job_number": "23637", "functional_Area": "Research - Scientific", "department": "Earth, Atmospheric &  Planetary Sciences", "school_Area": "Science", "employment_Type": "Full-Time Temporary", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "POSTDOCTORAL ASSOCIATE, MULTISCALE OCEAN MODELING, Earth, Atmospheric and Planetary Sciences (EAPS), to work with Assistant Professor Abigail Bodner and in collaboration with the Oceananigans developers at MIT, leveraging state-of-the-art GPU-based high-resolution simulations to address fundamental open-questions on multiscale upper ocean dynamics. The project will involve running and analyzing the Oceananigans large eddy simulation, resolving scales ranging from 100km down to single meters, and applying theoretical and machine learning approaches to develop new parameterizations for general circulation models.  ", "job_req": "Ph.D. in geosciences, statistics, physics, engineering, or a related field at the time of the appointment.", "job_pre": "background in fluid dynamics, turbulence, and/or oceanography; and experience working with numerical simulations, scientific programming, and/or machine learning.", "date": "1/23/24"}, {"job_idx": "5471015b-6dbc-43b0-8985-378e9ebd0b78", "job_title": "Senior Software Engineer", "job_number": "23638", "functional_Area": "Information Technology", "department": "Open Learning, Support Unit, Engineering", "school_Area": "Office of Provost", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "SENIOR SOFTWARE ENGINEER, Open Learning, to develop scalable software products with flexible APIs and advance best practices with the engineering team through participation in architecture, technical design, and code reviews.  Will write code in Python, JavaScript (ReactJS), HTML/CSS, and other languages as necessary; collaborate with the edX team and Open edX community to improve the Open edX platform; work closely with and brainstorm ideas and incorporate feedback from the engineering team, MIT community of developers, teachers, and learners, and the open source community at large; fix bugs and solve problems; and write documentation and automated tests. \n\nA full job description is at https://openlearning.mit.edu/jobs.  ", "job_req": "B.S. in computer science or related technical field; seven years of professional software development experience; solid understanding of the full web technology stack; proficiency in at least one programming language--Python, JavaScript, Ruby, Java, and/or PHP; proficiency creating web applications in one or more server-side frameworks--Django, Rails, NodeJS, etc.; and comprehensive knowledge of relational databases and SQL.", "job_pre": "familiarity with modern DevOps tools such as Docker, Pulumi, etc.; experience with ElasticSearch; and excellent communication skills.", "date": "REQUIRED:  B.S. in computer science or related technical field; seven years of professional software development experience; solid understanding of the full web technology stack; proficiency in at least one programming language--Python, JavaScript, Ruby, Java, and/or PHP; proficiency creating web applications in one or more server-side frameworks--Django, Rails, NodeJS, etc.; and comprehensive knowledge of relational databases and SQL.  PREFERRED:  familiarity with modern DevOps tools such as Docker, Pulumi, etc.; experience with ElasticSearch; and excellent communication skills.  Job #23638-10"}, {"job_idx": "32393b0e-ccde-4110-9dec-102173dca7b7", "job_title": "Postdoctoral Associate", "job_number": "23629", "functional_Area": "Research - Scientific", "department": "Plasma Science and Fusion Center", "school_Area": "VP Research", "employment_Type": "Full-Time Temporary", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "POSTDOCTORAL ASSOCIATE, Plasma Science and Fusion Center (PSFC), to carry out fundamental and applied research supporting the SPARC and ARC tokamaks, two devices expected to lead to deployment of fusion as an economic energy source. The work will focus on the study and impact of relativistic “runaway” electrons that can emerge in various plasma scenarios such as start-up and disruptions.  Will conduct simulations with state-of-the-art MHD and/or kinetic codes, evaluating runaway electron phase space evolution, confinement, and interactions with a runaway electron mitigation coil; and interface with several teams to inform how runaway electrons impact integrated modeling efforts, diagnostic design and implementation, and SPARC operations.  Will also make original research contributions to the PSFC program, produce work for publication, present work at scientific conferences, and mentor graduate and undergraduate students. ", "job_req": "Ph.D. in plasma physics or closely related field; broad knowledge of tokamak physics; experience conducting original scientific research and publishing in scientific journals.  We seek someone who can communicate effectively and enjoys working in a dynamic, fast-paced team environment with staff and students from MIT, other universities, national laboratories, and private industry.", "job_pre": "experience with nonlinear MHD and/or kinetic simulations, especially in the area of disruption physics (examples of such codes include M3D-C1 and DREAM), excellent programming skills, and knowledge of programming language such as Python and/or Fortran.", "date": "1/19/24"}, {"job_idx": "4882a774-3461-49ec-9d15-80fd8c427be9", "job_title": "Instructional Designer 2", "job_number": "23639", "functional_Area": "Research - Other", "department": "Comparative Media Studies/Writing", "school_Area": "Humanities, Arts, & Social Sciences", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "INSTRUCTIONAL DESIGNER 2, Comparative Media Studies (CMS)/Writing-MIT Scheller Teacher Education Program (STEP), to handle the placement and mentoring of MIT students who are pre-service STEM teachers. The primary tasks are operational and relational, but with opportunities to co-teach undergraduate courses and participate in/lead educational research and development projects.  Responsibilities include interviewing, screening, and selecting candidates and placing them in local schools with mentor teachers; advising/supervising student teachers, including formal/informal observations, identifying growth areas, determining if students meet state licensure requirements, and completing and processing state paperwork; meeting with mentor teachers to discuss student teacher growth, answer questions related to forms/paperwork, and assess/intervene if issues arise; supporting course instructors, including revising and developing curriculum, contributing to/teaching classes, grading and providing feedback on student writing, placing 25 students in classrooms for 20 observation hours, and responding to student emails/requests/inquiries; advising students interested in teaching or education-related careers; collaborating on various education-focused projects in the STEP lab; developing and creating professional development for teachers; and co-developing and leading teacher professional development on a variety of topics.  ", "job_req": "bachelor’s degree in a related field; five years’ relevant experience; three years’ secondary school teaching experience, preferably in math, science, or computer science; experience advising/mentoring college students or pre-service teachers; ability to organize and coordinate schedules/activities and set priorities, make decisions, and multitask with minimal supervision; excellent interpersonal and verbal and written communication skills; and experience with program, project, and/or event management.", "job_pre": "advanced degree in instructional design and technology; curriculum and program design experience in higher education or relevant area (e.g., education, math, sciences, or computer science); and pre-service teacher education or teacher mentoring experience.", "date": "1/23/24"}, {"job_idx": "6956ef73-927a-45b5-bf7d-88e4fc3e3b02", "job_title": "Quality Control Specialist", "job_number": "23494", "functional_Area": "Credit Union", "department": "Credit Union", "school_Area": "Credit Union", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "QUALITY CONTROL SPECIALIST, MIT Federal Credit Union (MITFCU), to perform quality control reviews on a sample of new member and share product applications, additional accounts for existing members, new joint memberships, name and ownership type changes, personal loans, real estate loans, ATM/debit card and check orders, wire transfers, IRAs, address changes, deceased members, trust accounts, and closed memberships.  Will perform control review of wire transfer function to ensure adherence to regulations, policies, and procedures; ensure quality, accuracy, and completeness of system information and adherence to policy, procedure, rules and regulations on reviewed documents; create and maintain quality control reports tracking documents reviewed, employees involved, error quantity and type, implemented resolutions, follow ups, and resolution dates; communicate with managers about unresolved errors; provide recommendations for improvement on reported items, trends, system updates, and any other issues identified; calculate and report on error ratio and identify trends; partner with managers and training staff to identify possible process improvement methods and help develop policies/ procedures; assist with the collection and organization of materials needed for internal and compliance audits; prepare materials and train staff to assist with quality control functions during membership drives; provide support for compliance department in all functionalities where needed; utilize opportunities to present and/or refer current and potential members to the MITFCU’s products and services; and demonstrate knowledge of BSA/AML policies and procedures and implement as necessary in daily activities. ", "job_req": "high school diploma or its equivalent; at least one year of financial services experience; meticulous attention to detail; ability to handle various tasks simultaneously; and familiarity with Microsoft Office, including Excel, Word, and Outlook.  Job #23494-4\n\n12/1/23", "job_pre": "", "date": "12/1/23"}, {"job_idx": "bc632866-ea80-4b57-83ea-b0fbd4973fd3", "job_title": "Administrative Assistant, Tangible Media Group", "job_number": "23640", "functional_Area": "Office Support", "department": "Media Lab", "school_Area": "Architecture & Planning", "employment_Type": "Part-time (Hybrid)", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "ADMINISTRATIVE ASSISTANT, Media Lab (part-time, 20 hrs/wk.), to support a senior faculty member and the researchers of the Tangible Media Group (TMG). The TMG focuses on the design of seamless interfaces between humans, digital information, and the physical environment in the ﬁeld of HCI (Human-Computer Interaction).  Will schedule and coordinate meetings (in person/Zoom) for the principal investigator (PI) and TMG, assign research assistants (RAs) for the demos, and handle room reservations, catering, set up, and clean up; keep PI's and TMG's Google Calendars up-to-date, including monitoring deadlines for upcoming important events; attend weekly TMG meetings; and proactively compose and respond to correspondence as an extension of the PI, including corporate sponsor, staﬀ, and student issues. \n\nA full job description is available at https://www.media.mit.edu/about/job-opportunities/.  ", "job_req": "high school diploma or its equivalent; at least three years of oﬃce experience as an administrative assistant or in a related role; ability to work collaboratively and eﬀectively with a creative and diverse group of people; attention to details and accuracy; a ﬂexible approach to the workload; and the ability to concurrently handle competing priorities in a fast-paced, open-oﬃce environment.", "job_pre": "associate’s or bachelor’s degree; knowledge of MIT business applications  (e.g., SAPgui and Concur), Keynote, PowerPoint, Google Docs, MS Word, Excel spreadsheets, PowerPoint, Miro, collaboration tools (e.g., Dropbox/Trello (Crafts/Notion), Slack/email (e.g., SNS: Facebook Twitter, Instagram, and Linkedin); and experience with Japanese clients/culture.", "date": "1/23/24"}, {"job_idx": "bc7b555a-2cef-4bda-b653-3aefedb1bf4b", "job_title": "Graduate Contract Administrator", "job_number": "23636", "functional_Area": "Student Services", "department": "Office of the Provost", "school_Area": "Office of Provost", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "GRADUATE CONTRACT ADMINISTRATOR, Office of the Provost (four openings*), to provide leadership, guidance, and coordination related to the implementation of the new MITGSU-UE collective bargaining agreement (CBA) and business process changes it brings to the graduate community.  Will partner with staff in MIT’s central offices to provide advice and case management support to faculty, deans, department heads, finance and administration directors, and graduate officers and administrators. Responsibilities include serving as a CBA and graduate student appointments specialist; convening staff and faculty to ensure that processes and practices are consistent and CBA-compliant; explaining procedures, timelines, and decisions; responding to step 2 grievances, analyzing documentation, and ensuring understanding of issues; staying informed about Institute policies, procedures, and CBA; collaborating on creating and disseminating training materials/guidelines/template communications; conducting workshops/training sessions; maintaining records; representing assigned school/college during collective bargaining and related activities; communicating with management to address concerns, negotiate solutions, and ensure CBA compliance; and other duties as assigned.  ", "job_req": "bachelor’s degree; five years’ human resources or academic administration experience, preferably involving graduate students and faculty; ability to understand and apply complex policies, triage concerns, advise stakeholders, informally resolve conflict, and escalate matters when appropriate; appreciation for the organizational environment in higher education and large research universities to understand client priorities/issues/motivations/constraints; excellent analytical, problem-solving, project planning and implementation, client service, relationship-building, presentation, and written and oral communication skills; knowledge of conflict resolution techniques; excellent judgment with confidential/sensitive information; and ability to work strategically, synthesize and generalize based on information obtained, deal with ambiguity and conflict, and influence people at all levels.", "job_pre": "experience supervising unionized employees or advising supervisors in a unionized environment.", "date": "1/23/24"}, {"job_idx": "2717d542-d290-48fa-b6f1-ac7d7aaff42f", "job_title": "Diversity and Inclusion Specialist", "job_number": "23634", "functional_Area": "Administration", "department": "Architecture", "school_Area": "Architecture & Planning", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "DIVERSITY AND INCLUSION SPECIALIST, Architecture, to support and further develop the department’s goal of supporting a diverse and inclusive culture.  Will bring and apply knowledge from the field of diversity, equity, and belonging to support best practices in the department and work to design and implement outreach activities throughout the department, with a primary focus on students; promote a sense of belonging throughout the department; work with internal and external partners to develop tools, resources, and a range of solutions to grow this culture; and help support diverse populations of students post-graduation, as well as within the department, by supporting its links to and support for graduated students.  \n\nA full description is available at https://architecture.mit.edu/jobs.  ", "job_req": "bachelor’s degree; five years’ professional work experience and track record of leading diversity and inclusion efforts in higher education; support for MIT’s commitment to diversity, equity, and inclusion; understanding of social justice, the dynamics of power and privilege and social identities; evidence of a strategic and tactical approach to diversity and inclusion and the ability to scale projects to achieve maximum impact; knowledge of community organization and experience working with students, staff, and faculty to create events around diversity and inclusion; experience facilitating learning opportunities for faculty, students, and staff; ability to manage multiple complex projects, collaborate across teams with diverse skills and areas of expertise; strong consultation, presentation, meeting design, and facilitation skills; and experience with successful change management and project management.", "job_pre": "master’s degree in higher education administration, human resources, social justice, or cultural diversity.", "date": "1/23/24"}, {"job_idx": "fd6f1f6a-2e3c-43ab-a1cd-14362d629831", "job_title": "Associate Director, Alumni Class Connections", "job_number": "23633", "functional_Area": "Alumni Relations", "department": "Alumni Association", "school_Area": "Alumni Association", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "ASSOCIATE DIRECTOR, ALUMNI CLASS CONNECTIONS, Alumni Association (MITAA), to develop and implement strategy to increase the engagement lifecycle for the youngest alumni (0-10 years out) through their partnership with the MITAA.  Will guide the MIT 10 Council to develop engaging programming ideas and connection opportunities; serve as the program lead for Pi Reunion; develop content for MIT10 alumni at Tech Reunion events and the Alumni Leadership Conference; liaise with the director and Alumni Programs to create engaging professional development content; support the director with marketing campaigns; and serve as the program co-lead for Family Weekend.  ", "job_req": "bachelor’s degree; three years’ experience in alumni relations, annual fund, BB, or public relations in a university or nonprofit setting; excellent planning, organizational, analytical, interpersonal, presentation, and oral and written communication skills; attention to detail; discretion and good judgment with confidential information; proficiency with computers and standard applications (including Microsoft Word, Excel, and PowerPoint); and expertise with/willingness to learn Anthology platform.  Seek someone who can demonstrate initiative, approach work strategically, and welcome change.  Must be able to recruit, motivate, train, and manage volunteers; establish effective working relationships with colleagues, alumni, and other constituents; collaborate as part of a team in a diverse service-oriented environment; effectively develop and deliver training sessions; influence others and move toward a common vision/goal; and multitask, prioritize assignments, and meet deadlines without compromising quality in a demanding, high-volume work environment.", "job_pre": "knowledge of Ellucian Advance Web or other enterprise fundraising system and web presentation software, e.g., WebEx and Zoom; data analysis, marketing, and/or public relations skills; and experience working in higher education advancement.", "date": "1/22/24"}, {"job_idx": "b9ad0f7a-7b05-4b44-ab07-6e1962ba0646", "job_title": "Research Support Associate, Hemann Lab", "job_number": "23631", "functional_Area": "Research - Scientific", "department": "Koch Inst - Integrative Cancer Research", "school_Area": "VP Research", "employment_Type": "Full-Time", "employment_Cat": "Non-Exempt", "visa_Spon_Avail": "No", "job_descrip": "RESEARCH SUPPORT ASSOCIATE 1, Koch Institute for Integrative Cancer Research-Hemann Lab, to provide basic laboratory support--under direct supervision--for researchers and their projects.  Will be responsible for data input, basic lab support functions, and lab administration such as maintaining lab calendar and lab directories and participating in planning and executing lab events and meetings; maintaining vendor relationships and equipment service contracts/records; scheduling the maintenance and repair of equipment; and assisting with maintaining laboratory inventory.  Other duties include mouse handling and cell culture assays, DNA cloning, FACS analyses, primary cell culture and isolation, and viral gene transfer. Data/analysis responsibilities include updating and maintaining data in laboratory databases; conducting online research; generating standardized reports; and using web software to input, update, and maintain web content.  ", "job_req": "high school diploma or its equivalent; excellent organizational, interpersonal, and written and verbal communication skills; ability to work both independently and as part of a team; commitment to exceeding quality standards, providing exceptional services, and producing accurate and high-quality work; meticulous attention to detail; practiced documentation skills; and an awareness of basic safety issues, including the ability to follow safety procedures and maintain a safe work environment. Must have experience conducting online research and applying information to projects based on scientific area of study.", "job_pre": "bachelor's degree, prior exposure to research lab, and familiarity with molecular biology.", "date": "1/19/24"}, {"job_idx": "ffe61e45-b8de-4428-b812-fbc14acaa94f", "job_title": "Technical Associate I, Cordero Lab", "job_number": "23630", "functional_Area": "Research - Engineering", "department": "Civil and Environmental Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time Temporary", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "TECHNICAL ASSOCIATE I, Civil and Environmental Engineering (CEE), to perform various laboratory research experiments and duties as a member of the Cordero Lab.  Will record test results, analyze data using statistical methodology, ensure inventory of appropriate lab supplies, and coordinate multiple research-related projects. ", "job_req": "bachelor’s degree in biology or related field; at least two years’ specialized lab experience (which may include experience gained as an undergraduate); understanding of research and broad knowledge of work of the lab(s); experience conducting on-line research and applying information to projects based on scientific area of study; ability to identify and select appropriate tools, data, and analysis techniques to diagnose problems and develop solutions; ability to make recommendations to solve and resolve highly complex problems; ability to engage in decision-making that is guided by varied and less defined instructions and practices requiring broader interpretation.  Job #23630\n\nThis is a one-year appointment with the possibility of an extension.\n\nEmployment is contingent upon the completion of a satisfactory background check.\n\n1/19/24", "job_pre": "", "date": "1/19/24"}, {"job_idx": "8c94b295-1489-49a5-9e1e-61ca666bf4ac", "job_title": "Marketing Specialist", "job_number": "23627", "functional_Area": "Credit Union", "department": "Credit Union", "school_Area": "Credit Union", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "MARKETING SPECIALIST, MIT Federal Credit Union (MITFCU), to build and execute multi-channel campaigns, drive social media engagement, and create relevant digital content to engage and support member and Credit Union needs.  Will support the marketing department's initiatives with the planning, executing, and tracking of marketing programs such as email, social media, digital advertising, events, or content marketing; coordinate the requests, planning, and execution of marketing campaigns, social media, SEO/SEM, and other marketing projects; assist with managing multiple external and internal vendors and teams in the creative development of digital content, advertising materials, media planning, and high-impact promotions; be responsible for day-to-day budget maintenance and awareness, including submission, tracking, and reporting; research and recommend new tools, strategies, segmentation, SEO, best practices, etc., to ensure all marketing efforts are as successful and up-to-date; assist in creating and maintaining editorial calendars and communicating deliverables; and perform other duties as assigned.  ", "job_req": "bachelor's degree in marketing, communications, or a related field; at least three years of marketing experience; experience with or interest in digital and social media, both paid and organic creative development and execution; excellent organizational, interpersonal, presentation development, visual/verbal storytelling, and writing skills; experience with the creative development process with key stakeholders; proficiency with Adobe Cloud, Word, PowerPoint, and Excel; and familiarity with standard research and ability to derive insights from the data.  Must be able to manage multiple projects simultaneously, develop strong relationships with management and editorial teams, communicate effectively with various teams, and present virtually and in person to an audience.", "job_pre": "credit union/financial institution experience.", "date": "1/19/24"}, {"job_idx": "8bce20af-5efe-433b-ac1a-216bdeaead5a", "job_title": "Salesforce System Administrator", "job_number": "23628", "functional_Area": "Information Technology", "department": "MIT Professional Education", "school_Area": "Engineering", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "SALESFORCE SYSTEM ADMINISTRATOR, School of Engineering-MIT Professional Education (PE), to work closely with functional leaders and program teams on leading the ongoing development of PE’s Salesforce.com deployment. Will execute the day-to-day configuration, support, maintenance, and improvements to the CRM platform; work with the CRM product manager to administer and configure the Salesforce application and recommend technical approaches; serve as a detail-oriented and customer-focused contributor; and support all program staff in the implementation and management of the Salesforce CRM system. \n\nMIT Professional Education (PE) offers a suite of education programs and products to serve the continuing educational needs of science and engineering professionals globally.  ", "job_req": "B.A/B.S.; two years Salesforce administrator experience; Salesforce Certified Business Analyst or Salesforce Administrator or Salesforce Advanced Administrator, and Salesforce Certified Service Cloud Consultant or Salesforce Certified Sales Cloud Consultant certifications; ability to build custom apps and objects, formula fields, workflows, custom views, flows, processes, and other configurations; understanding of Salesforce best practices; ability to design and implement new processes and facilitate user adoption; strong data management skills and ability to make data-driven decisions; ability to build productive and collaborative working relationships with individuals at all levels; excellent organizational, problem-solving, interpersonal, presentation, and oral and written communication skills; ability to work effectively in a fast-moving environment; flexible approach to changing demands; and knowledge of monitoring budgets and reviewing financial transactions.  PREFFERED: Salesforce Cloud consultant experience; app builder and developer certifications; knowledge of Conga with Salesforce integration; experience with SAP, Pardot, Concur, Quip, Slack, and other project management tools; and experience working in higher education or at MIT.  Job #23628-7\n\nPlease include both a resume and a cover letter as part of your application material.\n\nEmployment is contingent upon the completion of a satisfactory background check.\n\n1/19/24", "job_pre": "", "date": "1/19/24"}, {"job_idx": "9578b294-2f8f-473d-ab12-5b511e731048", "job_title": "Postdoctoral Associate, Critical Analysis of Carbon Capture and Sequestration", "job_number": "23626", "functional_Area": "Research - Engineering", "department": "Civil and Environmental Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time Temporary", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "", "job_req": "Ph.D. in energy systems, environmental economics, environmental policy, or related field; skillset in hydrology, biogeochemistry, ecology, mathematical modeling, field measurements, and technical writing; ability to communicate effectively and work both independently and on a multidisciplinary research team; strong quantitative skills; broad understanding of issues related to reducing greenhouse gas emissions; and an interest in environmental justice.", "job_pre": "familiarity with integrated assessment models.", "date": "1/19/24"}, {"job_idx": "76341efc-2e5b-48bf-a821-1e60a1d0ecc6", "job_title": "Postdoctoral Associate, Wetland Hydrology, Biogeochemistry, and Ecology", "job_number": "23625", "functional_Area": "Research - Engineering", "department": "Civil and Environmental Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time Temporary", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "", "job_req": "Ph.D. in environmental science or related field; skillset in hydrology, biogeochemistry, ecology, mathematical modeling, field measurements, and technical writing; ability to communicate effectively and work both independently and on a multidisciplinary research team; and strong qualitative and computational skills and an interest in collecting field data.", "job_pre": "knowledge of electromagnetic resistive tomography and methane dynamics in the environment.", "date": "1/19/24"}, {"job_idx": "7496719f-7008-4e0f-ae34-3955450f801e", "job_title": "Financial Officer", "job_number": "23214", "functional_Area": "Finance/Accounting", "department": "Department of Biological Engineering", "school_Area": "Engineering", "employment_Type": "Full-time (Hybrid)", "employment_Cat": "Exempt", "visa_Spon_Avail": "No", "job_descrip": "FINANCIAL OFFICER, Biological Engineering (BE), to work closely with the senior financial officer to administer and oversee complex pre- and post-award sponsored program activities.  Will serve as subject matter expert to faculty, staff, and students on the administration of sponsored contracts/grants and other areas of sponsored activities; utilize COEUS and other grant management systems for proposal preparation and processing; interact with principal investigators (PI) to develop a range of research proposal budgets and the administrative content of proposal submissions for a broad range of federal/industrial/foundation sponsors; monitor the financial performance of active grants/contracts and provide projections/updates to PIs to verify the proper distribution of resources and use of funds; provide financial analysis and oversight on complex matters and prepare reports for PIs, senior administrators, and sponsors; and ensure compliance with MIT and sponsor policies through the life of the award. \n\nA full position description is available here.  ", "job_req": "bachelor’s degree in finance, accounting, or related technical discipline; five years’ financial management experience; experience administering sponsored research programs in a university setting; strong communication, analytical, organizational, and interpersonal skills; discretion and sound judgment with confidential information; attention to detail; advanced-level knowledge of Microsoft Excel; and ability to learn sponsored research administration-related technologies.  Must be able to work independently and as part of a team; interact with faculty, staff, and students; and multitask, handle a large volume of work, and meet deadlines despite frequent interruptions in a fast-paced, challenging, and sometimes stressful environment.", "job_pre": "Kuali Coeus, SAP, Cognos, and Brio Query experience; grants management experience; and knowledge of Uniform Guidance, NIH, and other federal sponsor policies.", "date": "9/20/23"}, {"job_idx": "de724a6c-0cb2-4baa-ab7d-9027ebcd8308", "job_title": "Postdoctoral Associate", "job_number": "23624", "functional_Area": "Research - Engineering", "department": "Mechanical Engineering", "school_Area": "Engineering", "employment_Type": "Full-Time", "employment_Cat": "Exempt", "visa_Spon_Avail": "Yes", "job_descrip": "POSTDOCTORAL ASSOCIATE, Mechanical Engineering, to work with the Global Engineering and Research (GEAR) Center on the creation of an irrigation solution for Egyptian farmers by identifying the unique set of design technoeconomic requirements that must be met for the solution to be viable across different market segments. The solution integrates the team’s low-cost, low-energy, on- and off-grid desalination and drip irrigation technologies. This work will involve identifying key stakeholders and market segments among Egyptian farmers and understanding their preferences, needs, values, and priorities while considering technical tradeoffs and constraints imposed by the technology. The work will utilize stakeholder analysis, market research techniques, literature review, surveys, and semi-structured interviews, among other methods. The team is currently working with the National Water Resources Center in Egypt and the Egyptian office of the International Center for Agricultural Research in the Dry Areas (ICARDA) to provide access to Egyptian farmers and other stakeholders. This work will inform the design of a prototype system that will be fabricated and field-tested in Egypt in 2026. It will also be used to attract industry support and further buy-in by the U.S. and Egyptian governments.  The postdoc will provide staff support for student research projects and guide student research directions within a collaborative and highly team-oriented environment.  ", "job_req": "Ph.D. in mechanical engineering; and expertise in survey methods, semi-structured interviews, market research, and product design.  Job #23624\n\nThe position will require domestic and international travel (<10% of the time).\n\nThis is part of a multi-year collaboration between a sponsoring company, USAID, and the GEAR Center, with yearly funding extensions based on research progress and technological/economic viability.\n\n1/18/24", "job_pre": "", "date": "1/18/24"}]